In [3]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [4]:
#creating series by passing a list. panda creates the default integer index
pd.Series([1,np.nan,3,7,9, 42])

0     1.0
1     NaN
2     3.0
3     7.0
4     9.0
5    42.0
dtype: float64

In [5]:
#creating DataFrame by NumPy with dates as index and labeled columns
dates = pd.date_range('20181001', periods=8)
print(dates)
print(type(dates))

DatetimeIndex(['2018-10-01', '2018-10-02', '2018-10-03', '2018-10-04',
               '2018-10-05', '2018-10-06', '2018-10-07', '2018-10-08'],
              dtype='datetime64[ns]', freq='D')
<class 'pandas.core.indexes.datetimes.DatetimeIndex'>

In [6]:
df=pd.DataFrame(np.random.randn(8,5), index=dates, columns=list('ABCDE'))
df

                   A         B         C         D         E
2018-10-01 -0.755726 -1.012695  0.985145  0.838858  0.812867
2018-10-02  1.659017  1.847112  0.375505  1.944349 -0.302078
2018-10-03  0.834497  2.361801 -0.641087  0.658971 -0.013782
2018-10-04  0.197266 -1.777811 -0.528453  1.252362  1.093356
2018-10-05 -0.901133 -0.581696 -1.118873  0.656743 -0.820782
2018-10-06 -0.664391 -0.380020  1.047260  1.063034  0.272591
2018-10-07 -0.901478 -0.960617  1.137206  0.070548  2.163075
2018-10-08 -1.516899  0.863903 -0.302264  0.313805  0.101397

In [7]:
#viewing data
df.head()

                   A         B         C         D         E
2018-10-01 -0.755726 -1.012695  0.985145  0.838858  0.812867
2018-10-02  1.659017  1.847112  0.375505  1.944349 -0.302078
2018-10-03  0.834497  2.361801 -0.641087  0.658971 -0.013782
2018-10-04  0.197266 -1.777811 -0.528453  1.252362  1.093356
2018-10-05 -0.901133 -0.581696 -1.118873  0.656743 -0.820782

In [8]:
df.tail(2)

                   A         B         C         D         E
2018-10-07 -0.901478 -0.960617  1.137206  0.070548  2.163075
2018-10-08 -1.516899  0.863903 -0.302264  0.313805  0.101397

In [9]:
df.values

array([[-0.75572647, -1.01269521,  0.9851451 ,  0.83885841,  0.81286723],
       [ 1.65901729,  1.84711194,  0.37550502,  1.94434906, -0.30207782],
       [ 0.83449725,  2.36180086, -0.64108687,  0.65897137, -0.01378192],
       [ 0.1972655 , -1.77781149, -0.52845263,  1.25236171,  1.09335629],
       [-0.90113296, -0.58169565, -1.11887298,  0.65674319, -0.820782  ],
       [-0.66439059, -0.38001969,  1.0472595 ,  1.06303441,  0.27259087],
       [-0.90147775, -0.9606167 ,  1.13720621,  0.07054839,  2.16307494],
       [-1.51689916,  0.86390316, -0.30226427,  0.3138054 ,  0.10139744]])

In [10]:
#shows a quick statistic summary of your data:
df.describe()

              A         B         C         D         E
count  8.000000  8.000000  8.000000  8.000000  8.000000
mean  -0.256106  0.044997  0.119305  0.849834  0.413331
std    1.062419  1.478986  0.880027  0.582346  0.927211
min   -1.516899 -1.777811 -1.118873  0.070548 -0.820782
25%   -0.901219 -0.973636 -0.556611  0.571009 -0.085856
50%   -0.710059 -0.480858  0.036620  0.748915  0.186994
75%    0.356573  1.109705  1.000674  1.110366  0.882989
max    1.659017  2.361801  1.137206  1.944349  2.163075

In [11]:
df.index

DatetimeIndex(['2018-10-01', '2018-10-02', '2018-10-03', '2018-10-04',
               '2018-10-05', '2018-10-06', '2018-10-07', '2018-10-08'],
              dtype='datetime64[ns]', freq='D')

In [12]:
df.columns

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [13]:
#transposing your data
print("data")
print(df)
print("transpose")
print(df.T)

data
                   A         B         C         D         E
2018-10-01 -0.755726 -1.012695  0.985145  0.838858  0.812867
2018-10-02  1.659017  1.847112  0.375505  1.944349 -0.302078
2018-10-03  0.834497  2.361801 -0.641087  0.658971 -0.013782
2018-10-04  0.197266 -1.777811 -0.528453  1.252362  1.093356
2018-10-05 -0.901133 -0.581696 -1.118873  0.656743 -0.820782
2018-10-06 -0.664391 -0.380020  1.047260  1.063034  0.272591
2018-10-07 -0.901478 -0.960617  1.137206  0.070548  2.163075
2018-10-08 -1.516899  0.863903 -0.302264  0.313805  0.101397
transpose
   2018-10-01  2018-10-02  2018-10-03  2018-10-04  2018-10-05  2018-10-06  \
A   -0.755726    1.659017    0.834497    0.197266   -0.901133   -0.664391
B   -1.012695    1.847112    2.361801   -1.777811   -0.581696   -0.380020
C    0.985145    0.375505   -0.641087   -0.528453   -1.118873    1.047260
D    0.838858    1.944349    0.658971    1.252362    0.656743    1.063034
E    0.812867   -0.302078   -0.013782    1.093356   -0.820782    0.272591

   2018-10-07  2018-10-08
A   -0.901478   -1.516899
B   -0.960617    0.863903
C    1.137206   -0.302264
D    0.070548    0.313805
E    2.163075    0.101397

In [14]:
#Sorting by an axis
df.sort_index(axis=1, ascending=False)

                   E         D         C         B         A
2018-10-01  0.812867  0.838858  0.985145 -1.012695 -0.755726
2018-10-02 -0.302078  1.944349  0.375505  1.847112  1.659017
2018-10-03 -0.013782  0.658971 -0.641087  2.361801  0.834497
2018-10-04  1.093356  1.252362 -0.528453 -1.777811  0.197266
2018-10-05 -0.820782  0.656743 -1.118873 -0.581696 -0.901133
2018-10-06  0.272591  1.063034  1.047260 -0.380020 -0.664391
2018-10-07  2.163075  0.070548  1.137206 -0.960617 -0.901478
2018-10-08  0.101397  0.313805 -0.302264  0.863903 -1.516899

In [15]:
#sort by values
df.sort_values(by='D')

                   A         B         C         D         E
2018-10-07 -0.901478 -0.960617  1.137206  0.070548  2.163075
2018-10-08 -1.516899  0.863903 -0.302264  0.313805  0.101397
2018-10-05 -0.901133 -0.581696 -1.118873  0.656743 -0.820782
2018-10-03  0.834497  2.361801 -0.641087  0.658971 -0.013782
2018-10-01 -0.755726 -1.012695  0.985145  0.838858  0.812867
2018-10-06 -0.664391 -0.380020  1.047260  1.063034  0.272591
2018-10-04  0.197266 -1.777811 -0.528453  1.252362  1.093356
2018-10-02  1.659017  1.847112  0.375505  1.944349 -0.302078

In [16]:
#Creating a DataFrame by passing a dict of objects. dictionary objects get converted to series-like.
df1= pd.DataFrame({ 'A':'hi',
                    'B':1,
                    'C': 'foo',
                    'D': np.array([2]*4),
                    'E': pd.Series(np.random.randint(1,4,4),index=list(range(4)),dtype='float32')
                  })
df1

    A  B    C  D    E
0  hi  1  foo  2  3.0
1  hi  1  foo  2  2.0
2  hi  1  foo  2  2.0
3  hi  1  foo  2  3.0

In [17]:
#data types of columns
df1.dtypes

A     object
B      int64
C     object
D      int64
E    float32
dtype: object

In [18]:
a_ascii = ord('A')
a_ascii

65

In [19]:
alpha = [chr(i) for i in range(a_ascii, a_ascii+26)]
alpha

['A',
 'B',
 'C',
 'D',
 'E',
 'F',
 'G',
 'H',
 'I',
 'J',
 'K',
 'L',
 'M',
 'N',
 'O',
 'P',
 'Q',
 'R',
 'S',
 'T',
 'U',
 'V',
 'W',
 'X',
 'Y',
 'Z']

In [20]:
numbers= np.arange(26)
numbers

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
       17, 18, 19, 20, 21, 22, 23, 24, 25])

In [21]:
type(numbers)
#type(alpha)

numpy.ndarray

In [22]:
alpha_num= dict(zip(numbers,alpha))
#type(alpha_num)
alpha_num

{0: 'A',
 1: 'B',
 2: 'C',
 3: 'D',
 4: 'E',
 5: 'F',
 6: 'G',
 7: 'H',
 8: 'I',
 9: 'J',
 10: 'K',
 11: 'L',
 12: 'M',
 13: 'N',
 14: 'O',
 15: 'P',
 16: 'Q',
 17: 'R',
 18: 'S',
 19: 'T',
 20: 'U',
 21: 'V',
 22: 'W',
 23: 'X',
 24: 'Y',
 25: 'Z'}

In [23]:
pd.Series(alpha_num)

0     A
1     B
2     C
3     D
4     E
5     F
6     G
7     H
8     I
9     J
10    K
11    L
12    M
13    N
14    O
15    P
16    Q
17    R
18    S
19    T
20    U
21    V
22    W
23    X
24    Y
25    Z
dtype: object

In [24]:
#making series using a dictionary
d = {'a' : 0., 'b' : 1., 'c' : 2.}
pd.Series(d)

a    0.0
b    1.0
c    2.0
dtype: float64

In [25]:
ser=pd.Series(d, index=['m', 'n', 'b', 'c'])
ser

m    NaN
n    NaN
b    1.0
c    2.0
dtype: float64

In [26]:
df =df.sort_values(by=df.columns.tolist())
df

                   A         B         C         D         E
2018-10-08 -1.516899  0.863903 -0.302264  0.313805  0.101397
2018-10-07 -0.901478 -0.960617  1.137206  0.070548  2.163075
2018-10-05 -0.901133 -0.581696 -1.118873  0.656743 -0.820782
2018-10-01 -0.755726 -1.012695  0.985145  0.838858  0.812867
2018-10-06 -0.664391 -0.380020  1.047260  1.063034  0.272591
2018-10-04  0.197266 -1.777811 -0.528453  1.252362  1.093356
2018-10-03  0.834497  2.361801 -0.641087  0.658971 -0.013782
2018-10-02  1.659017  1.847112  0.375505  1.944349 -0.302078

In [27]:
#selecting via [], slicing
df[:3]

                   A         B         C         D         E
2018-10-08 -1.516899  0.863903 -0.302264  0.313805  0.101397
2018-10-07 -0.901478 -0.960617  1.137206  0.070548  2.163075
2018-10-05 -0.901133 -0.581696 -1.118873  0.656743 -0.820782

In [28]:
#Select a single column
df['B']

2018-10-08    0.863903
2018-10-07   -0.960617
2018-10-05   -0.581696
2018-10-01   -1.012695
2018-10-06   -0.380020
2018-10-04   -1.777811
2018-10-03    2.361801
2018-10-02    1.847112
Name: B, dtype: float64

In [29]:
#select using label
df.loc[dates[1]]

A    1.659017
B    1.847112
C    0.375505
D    1.944349
E   -0.302078
Name: 2018-10-02 00:00:00, dtype: float64

In [30]:
df.loc[:,['A','C']].sort_index(axis=0)

                   A         C
2018-10-01 -0.755726  0.985145
2018-10-02  1.659017  0.375505
2018-10-03  0.834497 -0.641087
2018-10-04  0.197266 -0.528453
2018-10-05 -0.901133 -1.118873
2018-10-06 -0.664391  1.047260
2018-10-07 -0.901478  1.137206
2018-10-08 -1.516899 -0.302264

In [31]:
df.at[dates[0],'A']

-0.755726468095979

In [32]:
df=df.reindex(dates)
df

                   A         B         C         D         E
2018-10-01 -0.755726 -1.012695  0.985145  0.838858  0.812867
2018-10-02  1.659017  1.847112  0.375505  1.944349 -0.302078
2018-10-03  0.834497  2.361801 -0.641087  0.658971 -0.013782
2018-10-04  0.197266 -1.777811 -0.528453  1.252362  1.093356
2018-10-05 -0.901133 -0.581696 -1.118873  0.656743 -0.820782
2018-10-06 -0.664391 -0.380020  1.047260  1.063034  0.272591
2018-10-07 -0.901478 -0.960617  1.137206  0.070548  2.163075
2018-10-08 -1.516899  0.863903 -0.302264  0.313805  0.101397

In [33]:
#select via position of passed integers
df.iloc[4]

A   -0.901133
B   -0.581696
C   -1.118873
D    0.656743
E   -0.820782
Name: 2018-10-05 00:00:00, dtype: float64

In [34]:
#integer slices
df.iloc[2:5,0:4]

                   A         B         C         D
2018-10-03  0.834497  2.361801 -0.641087  0.658971
2018-10-04  0.197266 -1.777811 -0.528453  1.252362
2018-10-05 -0.901133 -0.581696 -1.118873  0.656743

In [35]:
df[df.A>0]

                   A         B         C         D         E
2018-10-02  1.659017  1.847112  0.375505  1.944349 -0.302078
2018-10-03  0.834497  2.361801 -0.641087  0.658971 -0.013782
2018-10-04  0.197266 -1.777811 -0.528453  1.252362  1.093356

In [36]:
df[df>0]

                   A         B         C         D         E
2018-10-01       NaN       NaN  0.985145  0.838858  0.812867
2018-10-02  1.659017  1.847112  0.375505  1.944349       NaN
2018-10-03  0.834497  2.361801       NaN  0.658971       NaN
2018-10-04  0.197266       NaN       NaN  1.252362  1.093356
2018-10-05       NaN       NaN       NaN  0.656743       NaN
2018-10-06       NaN       NaN  1.047260  1.063034  0.272591
2018-10-07       NaN       NaN  1.137206  0.070548  2.163075
2018-10-08       NaN  0.863903       NaN  0.313805  0.101397

In [37]:
#Filter using isin()
df2=df.reindex(dates).copy()
df2['E']=['one', 'two', 'three', 'four', 'five', 'six', 'seven','eight']
df2[df2['E'].isin(['two','one'])]

                   A         B         C         D    E
2018-10-01 -0.755726 -1.012695  0.985145  0.838858  one
2018-10-02  1.659017  1.847112  0.375505  1.944349  two

In [38]:
df1.at[0,1]=0
df1

    A  B    C  D    E    1
0  hi  1  foo  2  3.0  0.0
1  hi  1  foo  2  2.0  NaN
2  hi  1  foo  2  2.0  NaN
3  hi  1  foo  2  3.0  NaN

In [39]:
df1.dropna(how='any')

    A  B    C  D    E    1
0  hi  1  foo  2  3.0  0.0

In [40]:
df1.fillna(value=5)

    A  B    C  D    E    1
0  hi  1  foo  2  3.0  0.0
1  hi  1  foo  2  2.0  5.0
2  hi  1  foo  2  2.0  5.0
3  hi  1  foo  2  3.0  5.0

In [41]:
 pd.isna(df1)

       A      B      C      D      E      1
0  False  False  False  False  False  False
1  False  False  False  False  False   True
2  False  False  False  False  False   True
3  False  False  False  False  False   True

In [42]:
df2.mean(axis=0)

A   -0.256106
B    0.044997
C    0.119305
D    0.849834
dtype: float64

In [43]:
df.at[dates[0],:]=9.0
df

                   A         B         C         D         E
2018-10-01  9.000000  9.000000  9.000000  9.000000  9.000000
2018-10-02  1.659017  1.847112  0.375505  1.944349 -0.302078
2018-10-03  0.834497  2.361801 -0.641087  0.658971 -0.013782
2018-10-04  0.197266 -1.777811 -0.528453  1.252362  1.093356
2018-10-05 -0.901133 -0.581696 -1.118873  0.656743 -0.820782
2018-10-06 -0.664391 -0.380020  1.047260  1.063034  0.272591
2018-10-07 -0.901478 -0.960617  1.137206  0.070548  2.163075
2018-10-08 -1.516899  0.863903 -0.302264  0.313805  0.101397

In [44]:
new_series = pd.Series([41,23,34,6,np.nan,9,1,78], index=dates).shift(2)
new_series

2018-10-01     NaN
2018-10-02     NaN
2018-10-03    41.0
2018-10-04    23.0
2018-10-05    34.0
2018-10-06     6.0
2018-10-07     NaN
2018-10-08     9.0
Freq: D, dtype: float64

In [45]:
print('df')
print(df)
df.sub(new_series,axis='index')

df
                   A         B         C         D         E
2018-10-01  9.000000  9.000000  9.000000  9.000000  9.000000
2018-10-02  1.659017  1.847112  0.375505  1.944349 -0.302078
2018-10-03  0.834497  2.361801 -0.641087  0.658971 -0.013782
2018-10-04  0.197266 -1.777811 -0.528453  1.252362  1.093356
2018-10-05 -0.901133 -0.581696 -1.118873  0.656743 -0.820782
2018-10-06 -0.664391 -0.380020  1.047260  1.063034  0.272591
2018-10-07 -0.901478 -0.960617  1.137206  0.070548  2.163075
2018-10-08 -1.516899  0.863903 -0.302264  0.313805  0.101397

                    A          B          C          D          E
2018-10-01        NaN        NaN        NaN        NaN        NaN
2018-10-02        NaN        NaN        NaN        NaN        NaN
2018-10-03 -40.165503 -38.638199 -41.641087 -40.341029 -41.013782
2018-10-04 -22.802734 -24.777811 -23.528453 -21.747638 -21.906644
2018-10-05 -34.901133 -34.581696 -35.118873 -33.343257 -34.820782
2018-10-06  -6.664391  -6.380020  -4.952740  -4.936966  -5.727409
2018-10-07        NaN        NaN        NaN        NaN        NaN
2018-10-08 -10.516899  -8.136097  -9.302264  -8.686195  -8.898603

In [46]:
#Applying functions to data
df.apply(np.cumsum)

                    A          B         C          D          E
2018-10-01   9.000000   9.000000  9.000000   9.000000   9.000000
2018-10-02  10.659017  10.847112  9.375505  10.944349   8.697922
2018-10-03  11.493515  13.208913  8.734418  11.603320   8.684140
2018-10-04  11.690780  11.431101  8.205966  12.855682   9.777497
2018-10-05  10.789647  10.849406  7.087093  13.512425   8.956715
2018-10-06  10.125256  10.469386  8.134352  14.575460   9.229305
2018-10-07   9.223779   9.508769  9.271558  14.646008  11.392380
2018-10-08   7.706880  10.372672  8.969294  14.959814  11.493778

In [47]:
df.apply(lambda x: x.max() - x.min())

A    10.516899
B    10.777811
C    10.118873
D     8.929452
E     9.820782
dtype: float64

In [48]:
s = pd.Series(np.random.randint(0, 7, size=10))
print(s)
print(s.value_counts())

0    3
1    3
2    5
3    2
4    4
5    0
6    6
7    0
8    2
9    1
dtype: int64
3    2
2    2
0    2
6    1
5    1
4    1
1    1
dtype: int64

In [49]:
#string method, str attribute
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Bca', np.nan, 'ABAC', 'cat','coW'])
print('s')
print(s,'\n')
print(s.str.lower())

s
0       A
1       B
2       C
3    Aaba
4     Bca
5     NaN
6    ABAC
7     cat
8     coW
dtype: object

0       a
1       b
2       c
3    aaba
4     bca
5     NaN
6    abac
7     cat
8     cow
dtype: object

In [50]:
#Merge
df = pd.DataFrame(np.random.randint(0,10, size=(10,4)))
df

   0  1  2  3
0  1  2  4  8
1  3  7  6  9
2  8  5  7  3
3  2  8  2  9
4  4  0  0  5
5  6  1  0  5
6  9  4  1  4
7  4  0  3  1
8  4  1  2  4
9  5  0  2  7

In [51]:
#break into pieces
pieces = [df[:3], df[3:7], df[7:]]
pieces

[   0  1  2  3
 0  1  2  4  8
 1  3  7  6  9
 2  8  5  7  3,    0  1  2  3
 3  2  8  2  9
 4  4  0  0  5
 5  6  1  0  5
 6  9  4  1  4,    0  1  2  3
 7  4  0  3  1
 8  4  1  2  4
 9  5  0  2  7]

In [52]:
pd.concat(pieces)

   0  1  2  3
0  1  2  4  8
1  3  7  6  9
2  8  5  7  3
3  2  8  2  9
4  4  0  0  5
5  6  1  0  5
6  9  4  1  4
7  4  0  3  1
8  4  1  2  4
9  5  0  2  7

In [53]:
#SQL style merge
left = pd.DataFrame({'key': ['Hi', 'Hi'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['Hi', 'Hi'], 'rval': [4, 5]})
print(left)
print(right)
pd.merge(left, right, on='key')

  key  lval
0  Hi     1
1  Hi     2
  key  rval
0  Hi     4
1  Hi     5

  key  lval  rval
0  Hi     1     4
1  Hi     1     5
2  Hi     2     4
3  Hi     2     5

In [54]:
left = pd.DataFrame({'key': ['Hi', 'yes'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['yes', 'Hi'], 'rval': [4, 5]})
print(left)
print(right)
pd.merge(left, right, on='key')

   key  lval
0   Hi     1
1  yes     2
   key  rval
0  yes     4
1   Hi     5

   key  lval  rval
0   Hi     1     5
1  yes     2     4

In [55]:
#Append
a=df.iloc[3]
df.append(a,ignore_index=True)
#without ignore_index, index 3 is appended as it is

    0  1  2  3
0   1  2  4  8
1   3  7  6  9
2   8  5  7  3
3   2  8  2  9
4   4  0  0  5
5   6  1  0  5
6   9  4  1  4
7   4  0  3  1
8   4  1  2  4
9   5  0  2  7
10  2  8  2  9

In [56]:
df.groupby(1).sum()

    0  2   3
1
0  13  5  13
1  10  2   9
2   1  4   8
4   9  1   4
5   8  7   3
7   3  6   9
8   2  2   9

In [60]:
df.groupby([1,2]).sum()

     0  3
1 2
0 0  4  5
  2  5  7
  3  4  1
1 0  6  5
  2  4  4
2 4  1  8
4 1  9  4
5 7  8  3
7 6  3  9
8 2  2  9

In [69]:
#reshaping
tuples= list(zip(*[['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'],
                   ['one', 'two', 'one', 'two','one', 'two', 'one', 'two']]))
print(tuples)
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])
print(index)

[('bar', 'one'), ('bar', 'two'), ('baz', 'one'), ('baz', 'two'), ('foo', 'one'), ('foo', 'two'), ('qux', 'one'), ('qux', 'two')]
MultiIndex(levels=[['bar', 'baz', 'foo', 'qux'], ['one', 'two']],
           labels=[[0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 0, 1, 0, 1, 0, 1]],
           names=['first', 'second'])

In [72]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])
#print(df)
df

                     A         B
first second
bar   one    -1.423490  0.699115
      two    -0.044293 -0.039013
baz   one    -0.338561  0.907503
      two    -0.854998 -0.933739
foo   one    -0.767569 -1.011165
      two    -1.850154 -1.867616
qux   one     0.143427  1.572421
      two     0.887213  0.495385

                     A         B
first second
bar   one    -1.423490  0.699115
      two    -0.044293 -0.039013
baz   one    -0.338561  0.907503
      two    -0.854998 -0.933739
foo   one    -0.767569 -1.011165
      two    -1.850154 -1.867616
qux   one     0.143427  1.572421
      two     0.887213  0.495385

In [73]:
df2 = df[:4]
df2

                     A         B
first second
bar   one    -1.423490  0.699115
      two    -0.044293 -0.039013
baz   one    -0.338561  0.907503
      two    -0.854998 -0.933739

In [75]:
#The stack() method compresses a level in the DataFrames columns.
stacked = df2.stack()
stacked

first  second
bar    one     A   -1.423490
               B    0.699115
       two     A   -0.044293
               B   -0.039013
baz    one     A   -0.338561
               B    0.907503
       two     A   -0.854998
               B   -0.933739
dtype: float64

In [76]:
stacked.unstack()

                     A         B
first second
bar   one    -1.423490  0.699115
      two    -0.044293 -0.039013
baz   one    -0.338561  0.907503
      two    -0.854998 -0.933739

In [77]:
stacked.unstack(1)

second        one       two
first
bar   A -1.423490 -0.044293
      B  0.699115 -0.039013
baz   A -0.338561 -0.854998
      B  0.907503 -0.933739

In [78]:
stacked.unstack(0)

first          bar       baz
second
one    A -1.423490 -0.338561
       B  0.699115  0.907503
two    A -0.044293 -0.854998
       B -0.039013 -0.933739

In [81]:
#pivot tables
abc = pd.DataFrame({'A' : ['one', 'one', 'two', 'three'] * 3,\
                    'B' : ['A', 'B', 'C'] * 4,\
                    'C' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,\
                    'D' : np.random.randn(12),\
                    'E' : np.random.randn(12)})
abc

        A  B    C         D         E
0     one  A  foo -1.487799  1.171236
1     one  B  foo -0.494491 -2.614126
2     two  C  foo  0.620949 -1.237086
3   three  A  bar -0.623321  1.249816
4     one  B  bar -1.736641  0.575507
5     one  C  bar -0.890464 -0.062476
6     two  A  foo  0.418718 -0.225355
7   three  B  foo -1.189637 -0.118481
8     one  C  foo  1.539454  0.844984
9     one  A  bar -0.211253  0.472532
10    two  B  bar -0.240586  0.459111
11  three  C  bar -0.423852  1.358190

In [82]:
pd.pivot_table(abc, values='D', index=['A', 'B'], columns=['C'])

C             bar       foo
A     B
one   A -0.211253 -1.487799
      B -1.736641 -0.494491
      C -0.890464  1.539454
three A -0.623321       NaN
      B       NaN -1.189637
      C -0.423852       NaN
two   A       NaN  0.418718
      B -0.240586       NaN
      C       NaN  0.620949